// **************************
//  ЗАдача з код варсу

// /*Після важкої роботи в офісі ви вирішили трохи відпочити у відпустці. Тож ви забронюєте рейс для себе та вашої дівчини та спробуєте залишити весь безлад позаду.

// Вам знадобиться орендований автомобіль, щоб пересуватися під час відпустки. Менеджер автопрокату робить вам вигідні пропозиції.

// Кожен день оренди автомобіля коштує 40 доларів. Якщо ви орендуєте автомобіль на 7 і більше днів, ви отримуєте знижку 50 доларів США. Крім того, якщо ви орендуєте автомобіль на 3 або більше днів, ви отримуєте 20 доларів США від загальної суми.

// Напишіть код, який видає загальну суму за різні дні (d). */

// function rentalCarCost(d) {
//     return  (d >= 3 && d < 7) ? (d * 40) - 20 : (d >= 7) ? (d * 40) - 50 : d * 40
// }
// // const rentalCarCost = d => (d >= 3 && d < 7) ? (d * 40) - 20 : (d >= 7) ? (d * 40) - 50 : d * 40;


// console.log(rentalCarCost(1));
// // Відповідь - 40
// console.log(rentalCarCost(2));
// // Відповідь - 80
// console.log(rentalCarCost(3));
// // Відповідь - 100
// console.log(rentalCarCost(4));
// // Відповідь - 140
// console.log(rentalCarCost(5));
// // Відповідь - 180
// console.log(rentalCarCost(6));
// // Відповідь - 220
// console.log(rentalCarCost(7));
// // Відповідь - 230
// console.log(rentalCarCost(8));
// // Відповідь - 270
// console.log(rentalCarCost(9));
// // Відповідь - 310
// console.log(rentalCarCost(10));
// // Відповідь - 350



// // Відповідь
// function rentalCarCost(d) {
//   return  (d >= 3 && d < 7) ? (d * 40) - 20 : (d >= 7) ? (d * 40) - 50 : d * 40
// }

// **************************

// // Напиши функцію formatString(string) яка приймає рядок і форматує його якщо
// // необхідно.

// // Якщо довжина рядка не перевищує 40 символів, функція повертає її в початковому
// // вигляді. Якщо довжина більше 40 символів, то функція обрізає рядок до 40-ка
// // символів і додає в кінець рядка три крапки '...', після чого повертає укорочену
// // версію

// // ```js
// const formatString = function (string) {
//   // твій код
//     if (string.length > 40) {
//         return string.split('').splice((string.split('')[0]), 40,).join('') + '...';
//     }
// };

// /*
//  * Виклич функції для перевірки працездатності твоєї реалізації.
//  */
// console.log(formatString('Curabitur ligula sapien, tincidunt non.'));
// // повернеться оригінальний рядок

// console.log(formatString('Vestibulum facilisis, purus nec pulvinar iaculis.'));
// // повернеться форматований рядок

// console.log(formatString('Curabitur ligula sapien.'));
// // повернеться оригінальний рядок


// **************************

